# GetNumberOfSegments Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPAnalyticalModelData..::..GetNumberOfSegments Method
MEPAnalyticalModelData Class See Also
---
Returns the number of analytical segments.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public int GetNumberOfSegments()
```

Visual Basic
---
```text
Public Function GetNumberOfSegments As Integer
```

Visual C++
---
```text
public:
int GetNumberOfSegments()
```

# ### Return Value
The total number of
# See Also
MEPAnalyticalModelData Class
Autodesk.Revit.DB.Analysis Namespace